In [12]:
import pandas

def read_data(file_name):
    csv_file = pandas.read_csv(f'../data/{file_name}.csv')
    return csv_file


student_info = read_data('studentInfo')
# convert type of student
# student_info['id_student'] = student_info['id_student'].astype(str)

# student_info['id'] = student_info['id_student'].astype(str) + '_' + student_info['code_module'] + '_' + student_info["code_presentation"]
student_info.head()
student_info.describe(include='all')

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
count,32593,32593,3.259300e+04,32593,32593,32593,31482,32593,32593.000000,32593.000000,32593,32593
unique,7,4,NaN,2,13,5,10,3,NaN,NaN,2,4
top,BBB,2014J,NaN,M,Scotland,A Level or Equivalent,20-30%,0-35,NaN,NaN,N,Pass
freq,7909,11260,NaN,17875,3446,14045,3654,22944,NaN,NaN,29429,12361
mean,NaN,NaN,7.066877e+05,NaN,NaN,NaN,NaN,NaN,0.163225,79.758691,NaN,NaN
std,NaN,NaN,5.491673e+05,NaN,NaN,NaN,NaN,NaN,0.479758,41.071900,NaN,NaN
min,NaN,NaN,3.733000e+03,NaN,NaN,NaN,NaN,NaN,0.000000,30.000000,NaN,NaN
25%,NaN,NaN,5.085730e+05,NaN,NaN,NaN,NaN,NaN,0.000000,60.000000,NaN,NaN
50%,NaN,NaN,5.903100e+05,NaN,NaN,NaN,NaN,NaN,0.000000,60.000000,NaN,NaN
75%,NaN,NaN,6.444530e+05,NaN,NaN,NaN,NaN,NaN,0.000000,120.000000,NaN,NaN
max,NaN,NaN,2.716795e+06,NaN,NaN,NaN,NaN,NaN,6.000000,655.000000,NaN,NaN

In [13]:
student_registration = read_data("studentRegistration")
merged_df = pandas.merge(student_info, student_registration, on=['id_student', 'code_module', 'code_presentation'])
merged_df.head()
merged_df.describe(include='all')

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,date_registration,date_unregistration
count,32593,32593,3.259300e+04,32593,32593,32593,31482,32593,32593.000000,32593.000000,32593,32593,32548.000000,10072.000000
unique,7,4,NaN,2,13,5,10,3,NaN,NaN,2,4,NaN,NaN
top,BBB,2014J,NaN,M,Scotland,A Level or Equivalent,20-30%,0-35,NaN,NaN,N,Pass,NaN,NaN
freq,7909,11260,NaN,17875,3446,14045,3654,22944,NaN,NaN,29429,12361,NaN,NaN
mean,NaN,NaN,7.066877e+05,NaN,NaN,NaN,NaN,NaN,0.163225,79.758691,NaN,NaN,-69.411300,49.757645
std,NaN,NaN,5.491673e+05,NaN,NaN,NaN,NaN,NaN,0.479758,41.071900,NaN,NaN,49.260522,82.460890
min,NaN,NaN,3.733000e+03,NaN,NaN,NaN,NaN,NaN,0.000000,30.000000,NaN,NaN,-322.000000,-365.000000
25%,NaN,NaN,5.085730e+05,NaN,NaN,NaN,NaN,NaN,0.000000,60.000000,NaN,NaN,-100.000000,-2.000000
50%,NaN,NaN,5.903100e+05,NaN,NaN,NaN,NaN,NaN,0.000000,60.000000,NaN,NaN,-57.000000,27.000000
75%,NaN,NaN,6.444530e+05,NaN,NaN,NaN,NaN,NaN,0.000000,120.000000,NaN,NaN,-29.000000,109.000000
max,NaN,NaN,2.716795e+06,NaN,NaN,NaN,NaN,NaN,6.000000,655.000000,NaN,NaN,167.000000,444.000000

In [14]:
courses = read_data("courses")
merged_df = pandas.merge(merged_df, courses, on=['code_module', 'code_presentation'])
merged_df.head()

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,date_registration,date_unregistration,module_presentation_length
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,-159.0,NaN,268
1,AAA,2013J,28400,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass,-53.0,NaN,268
2,AAA,2013J,30268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn,-92.0,12.0,268
3,AAA,2013J,31604,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass,-52.0,NaN,268
4,AAA,2013J,32885,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass,-176.0,NaN,268

In [15]:
student_vles = read_data("studentVle")
vles = read_data("vle")

vles = pandas.merge(student_vles, vles, on=['code_module', 'code_presentation', 'id_site'])
vles.head()

,code_module,code_presentation,id_student,id_site,date,sum_click,activity_type,week_from,week_to
0,AAA,2013J,28400,546652,-10,4,forumng,NaN,NaN
1,AAA,2013J,28400,546652,-10,1,forumng,NaN,NaN
2,AAA,2013J,28400,546652,-10,1,forumng,NaN,NaN
3,AAA,2013J,28400,546652,-10,8,forumng,NaN,NaN
4,AAA,2013J,30268,546652,-10,3,forumng,NaN,NaN

In [16]:
grouped_vles_per_day = vles.groupby(["code_module", "code_presentation", "id_student", "id_site", "date", "activity_type"]).agg({
    "sum_click": "sum"
}).reset_index()

In [17]:

grouped_vles_per_day["vles"] = grouped_vles_per_day[["id_site", "date", "activity_type", "sum_click"]].values.tolist()     
grouped_vles_per_day.head()

,code_module,code_presentation,id_student,id_site,date,activity_type,sum_click,vles
0,AAA,2013J,11391,546614,-5,homepage,7,"[546614, -5, homepage, 7]"
1,AAA,2013J,11391,546614,0,homepage,10,"[546614, 0, homepage, 10]"
2,AAA,2013J,11391,546614,1,homepage,9,"[546614, 1, homepage, 9]"
3,AAA,2013J,11391,546614,2,homepage,3,"[546614, 2, homepage, 3]"
4,AAA,2013J,11391,546614,6,homepage,1,"[546614, 6, homepage, 1]"

In [18]:
grouped_vles_per_student = grouped_vles_per_day.groupby(["code_module", "code_presentation", "id_student"], as_index=False).agg({
    "vles": lambda x: list(x)
})
grouped_vles_per_student.head()

,code_module,code_presentation,id_student,vles
0,AAA,2013J,11391,"[[546614, -5, homepage, 7], [546614, 0, homepa..."
1,AAA,2013J,28400,"[[546614, -10, homepage, 11], [546614, -8, hom..."
2,AAA,2013J,30268,"[[546614, -10, homepage, 3], [546614, -9, home..."
3,AAA,2013J,31604,"[[546614, -10, homepage, 11], [546614, -9, hom..."
4,AAA,2013J,32885,"[[546614, -10, homepage, 13], [546614, -9, hom..."

In [19]:
head_grouped_vles = grouped_vles_per_student.head()
head_merged_df = merged_df.head()

merged_df = pandas.merge(head_grouped_vles, head_merged_df, on=["code_module", "code_presentation", "id_student"])
merged_df.head()

,code_module,code_presentation,id_student,vles,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result,date_registration,date_unregistration,module_presentation_length
0,AAA,2013J,11391,"[[546614, -5, homepage, 7], [546614, 0, homepa...",M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass,-159.0,NaN,268
1,AAA,2013J,28400,"[[546614, -10, homepage, 11], [546614, -8, hom...",F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass,-53.0,NaN,268
2,AAA,2013J,30268,"[[546614, -10, homepage, 3], [546614, -9, home...",F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn,-92.0,12.0,268
3,AAA,2013J,31604,"[[546614, -10, homepage, 11], [546614, -9, hom...",F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass,-52.0,NaN,268
4,AAA,2013J,32885,"[[546614, -10, homepage, 13], [546614, -9, hom...",F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass,-176.0,NaN,268